%Оценка качества передачи сигнала с фазовой модуляцией
%Используемые показатели:
%Вероятность уверенного приёма сигнала - PO.
%Исследуемые факторы влияния: 
%Расстояние от источника до приемника - R;
%Уровень (мощность) шума на входе приемника - NP;  
clear all;
%Задание интервала дискретизации по времени и количества отсчетов на 
%интервале моделирования [0,10] с.
Ts=0.001; %интервал дискретизации
Ns=10000; %количество интервалов
% 1. Оценка PO в зависимости от NP и R при фиксированных Am и mr
%Задание неварьируемых величин
Am = 15;
mr = 0.7; %коэффициент различимости
%Задание количества и диапазонов изменения факторов NP (a) и R (b)
nf=2;
minf=[0.02 4];
maxf=[0.8 10];
%формирование дробного двухуровневого плана эксперимента
%для учета взаимодействий
fracfact('a b ab' );
N=2^nf;
fracplan=ans;
fictfact=ones(N,1);
X=[fictfact ans]';
fraceks=zeros(N,nf);
for i=1:nf,
    for j=1:N,
        fraceks(j,i)=minf(i)+(fracplan(j,i)+1)*(maxf(i)-minf(i))/2;
    end;
end;
fraceks
%тактическое планирование эксперимента
%задание доверительного интервала и уровня значимости
dp=0.9;
alpha=0.01;
%определение t-критического
tkr_alpha=norminv(1-alpha/2);
%определение требуемого числа испытаний
NE=round(tkr_alpha^2/(4*dp^2)) 

%цикл по совокупности экспериментов стратегического плана
for j=1:N,
    a=fraceks(j,1); 
    b=fraceks(j,2);
    NP=a %мощность шума
    R=b %радиус
    %цикл статистических испытаний с фиксированным объемом
    %выборки для достижения заданной точности оценки показателя
    uo=zeros(NE,1);
    u1=zeros(NE,1);
    for k=1:NE,
        %имитация функционирования системы
        to= round(rand*100); %инициализация генератора белого шума
        sim('trenl',Ts*Ns);
        uo = simout; 
        u1 = simout1;
    end;
    
    counter = 0;
    for ind = 1:length(uo),
        if uo(ind) == u1(ind)
            counter = counter+1;
        end;
    end;
    probability = counter/length(uo);
    %оценка показателя (реакции) по выборке наблюдений
    P_O=mean(probability)
    Y(j)=P_O; 
end;
%определение коэффициентов регрессии
C=X*X';
b_=inv(C)*X*Y'
%формирование зависимости реакции системы на множестве значений факторов
A=minf(1):0.01:maxf(1);
B=minf(2):0.1:maxf(2);
[k N1]=size(A);
[k N2]=size(B);
for i=1:N1,
    for j=1:N2,
        an(i)=2*(A(i)-minf(1))/(maxf(1)-minf(1))-1;
        bn(j)=2*(B(j)-minf(2))/(maxf(2)-minf(2))-1;
        %экспериментальная поверхность реакции
        Yc(j,i)=b_(1)+an(i)*b_(2)+bn(j)*b_(3)+an(i)*bn(j)*b_(4);
    end;
end;

% отображение зависимостей в трехмерной графике 
[x,y]=meshgrid(A,B);
figure;
plot3(x,y,Yc),
xlabel('NP'),
ylabel('R'),
zlabel('Yc'),
title('PO'),
grid on;

%Оценка качества передачи сигнала с фазовой модуляцией
%Используемые показатели:
%Интенсивность ложных тревог - L.
%Исследуемые факторы влияния: 
%Расстояние от источника до приемника - R;
%Коэффициент различимости - mr (превышения порога обнаружения 
%над уровнем шума uo=mr*sqrt(NP)). 
clear all;
%Задание интервала дискретизации по времени и количества отсчетов на 
%интервале моделирования [0,10] с.
Ts=0.001;
Ns=10000;
%  1. Оценка СКО в зависимости от NP и R при фиксированных mr
%Задание неварьируемых величин
Am = 15;
NP = 0.8; %мощность шума
%Задание количества и диапазонов изменения факторов NP (a) и R (b)
nf=2;
minf=[0.0008 3];
maxf=[0.5 12];
%формирование дробного двухуровневого плана эксперимента
%для учета взаимодействий
fracfact('a b ab' );
N=2^nf;
fracplan=ans;
fictfact=ones(N,1);
X=[fictfact ans]';
fraceks=zeros(N,nf);
for i=1:nf,
    for j=1:N,
        fraceks(j,i)=minf(i)+(fracplan(j,i)+1)*(maxf(i)-minf(i))/2;
    end;
end;
fraceks
%тактическое планирование эксперимента
%задание доверительного интервала и уровня значимости
dm=0.1; %увеличен интервал, для уменьшения количаства испытаний
alpha=0.04;
%определение t-критического
tkr_alpha=norminv(1-alpha/2);
%цикл по совокупности экспериментов стратегического плана
for j=1:N, 
    a=fraceks(j,1); 
    b=fraceks(j,2); 
    mr=a 
    R=b 
    %организация цикла статистических испытаний с переменным объемом
    %выборки для достижения заданной точности оценки показателя
    NE=1; 
    l=0; 
    SQ=0; 
    D=1; 
    while NE < tkr_alpha^2*D/dm^2, 
        %имитация функционирования системы
        to=round(rand*100); %randseed; %инициализация генератора шума
        sim('trenl',Ts*Ns); 
        uo = simout; 
        u1 = simout1; 
        
        counter = 0;
        for ind = 1:length(uo),
            if uo(ind) ~= u1(ind)
                counter = counter+1;
            end;
        end;
        probability(NE) = counter/(Ts*Ns);
        
        %Оценка выборочной дисперсии D измеряемого параметра
        l=l+probability(NE); 
        SQ=SQ+probability(NE)^2; 
        % средний квадрат отклонения:
        if NE>20 D=SQ/(NE-1)-(l^2)/(NE*(NE-1)); end; 
        NE=NE+1; 
    end; 
    NE=NE-1 
    %оценка показателя (реакции) по выборке наблюдений
    L=mean(probability) 
    Y(j)=L; 
end; 

%определение коэффициентов регрессии
C=X*X';
b_=inv(C)*X*Y'
%формирование зависимости реакции системы на множестве
%значений факторов
A=minf(1):0.01:maxf(1);
B=minf(2):0.1:maxf(2);
[k N1]=size(A);
[k N2]=size(B);
for i=1:N1,
    for j=1:N2,
        an(i)=2*(A(i)-minf(1))/(maxf(1)-minf(1))-1;
        bn(j)=2*(B(j)-minf(2))/(maxf(2)-minf(2))-1;
        %экспериментальная поверхность реакции
        Yc(j,i)=b_(1)+an(i)*b_(2)+bn(j)*b_(3)+an(i)*bn(j)*b_(4);
    end;
end;

% отображение зависимостей в трехмерной графике 
[x,y]=meshgrid(A,B);
figure;
plot3(x,y,Yc),
xlabel('mr'),
ylabel('R'),
zlabel('Yc'),
title('L'),
grid on;